Catalogs/ЭлементыЭлектронныхРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭлементыЭлектронныхРесурсов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭлектронныеРесурсы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовЭлектронныхРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроигрыватьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВнешнийЭлемент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеЭлемента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОбмена</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеДляИндексирования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Гиперссылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементСодержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраницыЭлементовЭлектронныхКурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыЭлементовЭлектронныхРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовЭлектронныхРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>File</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Folder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Media</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Image</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Video</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Audio</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Document</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DataProcessor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Text</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Presentation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Table</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YouTube</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭлементыЭлектронныхРесурсов/Forms/ВыборСпособаРазмещенияВидео/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ФорматВидеоВИнтернете) Тогда
		ФорматВидеоВИнтернете = "video/mp4"
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВставитьВидеоYouTube(Команда)
	
	Если НЕ ЗначениеЗаполнено(АдресВидеоYouTube) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес видео YouTube не указан'"),,"ВставитьВидеоYouTube","ВставитьВидеоYouTube");
		Возврат;
	КонецЕсли;
	
	ИдентификаторВидео = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ИдентификаторВидеоYouTubeИзURI(АдресВидеоYouTube);
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторВидео) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес не содержит идентификатор видео.
		|Укажите адрес страницы видео с сайта youtube.com.'"),,"ВставитьВидеоYouTube","ВставитьВидеоYouTube");
		Возврат;
	КонецЕсли;	
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВидеоYouTube");
	РезультатВыбора.Вставить("ИдентификаторВидео", ИдентификаторВидео);
	
	Закрыть(РезультатВыбора);		
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВидеоИзИнтернета(Команда)
	
	Если НЕ ЗначениеЗаполнено(АдресВидеоВИнтернете) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес видео не указан'"),,"АдресВидеоВИнтернете","АдресВидеоВИнтернете");
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВидеоИзИнтернета");
	РезультатВыбора.Вставить("ГиперссылкаНаВидео", АдресВидеоВИнтернете);
	РезультатВыбора.Вставить("ФорматВидео", ФорматВидеоВИнтернете);
	
	Закрыть(РезультатВыбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВидеоСДиска(Команда)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайлаВидеоВХранилище", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
		
	#Иначе
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайлаВидео", ЭтотОбъект);
	
	МассивТиповВыбора = Новый Массив;
	МассивТиповВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовЭлектронныхРесурсов.Video"));
	
	ДиалогВыбораВидео = РазработкаЭлектронныхКурсовСлужебныйКлиент.ДиалогВыбораФайлаПоТипу(
		МассивТиповВыбора,
		НСтр("ru = 'Выберите файл с видео'"),
		НСтр("ru = 'Видео'"));
	
	ДиалогВыбораВидео.Показать(ОписаниеОповещения);
	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПослеВыбораФайлаВидео(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВыбранныеФайлы");
	РезультатВыбора.Вставить("ВыбранныеФайлы", ВыбранныеФайлы);
	
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиФайлаВидеоВХранилище(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ПомещенныеФайлы");
	РезультатВыбора.Вставить("Результат", Результат);
	РезультатВыбора.Вставить("Адрес", Адрес);
	РезультатВыбора.Вставить("ВыбранноеИмяФайла", ВыбранноеИмяФайла);
	
	Закрыть(РезультатВыбора);	
	
КонецПроцедуры

#КонецОбласти
